In [54]:
import numpy as np
import pandas as pd

In [55]:
df = pd.read_csv(r"../dataset/Salary_Data.csv")

In [56]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

Merubah beberapa nama kolom

In [58]:
data_new = df.rename(columns={
    'Age' : 'age',
    'Gender' : 'gender',
    'Education Level' : 'education_level',
    'Job Title' : 'job',
    'Years of Experience' : 'years_of_experience',
    'Salary' : 'salary'
})

In [59]:
# clean data column education_level
# nilai Bachelor's dan Bachelor's Degree sama
# nilai Master's dan Master's Degree sama
# data PhD dan phD sama
data_new['education_level'].unique()

array(["Bachelor's", "Master's", 'PhD', nan, "Bachelor's Degree",
       "Master's Degree", 'High School', 'phD'], dtype=object)

In [60]:
# Mereplace data 
data_new['education_level'] = data_new['education_level'].replace({
    "Bachelor's Degree" : "Bachelor's",
    "Master's Degree" : "Master's",
    "PhD" : "phD"})

Cek & Handling null values dalam dataset

In [61]:
# Cek Apakah ada null values
data_new.isnull().sum()

age                    2
gender                 2
education_level        3
job                    2
years_of_experience    3
salary                 5
dtype: int64

In [62]:
data_new[data_new['age'].isnull()]

     age gender education_level  job  years_of_experience  salary
172  NaN    NaN             NaN  NaN                  NaN     NaN
260  NaN    NaN             NaN  NaN                  NaN     NaN

In [63]:
data_new[data_new['gender'].isnull()]

     age gender education_level  job  years_of_experience  salary
172  NaN    NaN             NaN  NaN                  NaN     NaN
260  NaN    NaN             NaN  NaN                  NaN     NaN

In [64]:
data_new[data_new['education_level'].isnull()]

       age gender education_level        job  years_of_experience    salary
172    NaN    NaN             NaN        NaN                  NaN       NaN
260    NaN    NaN             NaN        NaN                  NaN       NaN
2011  27.0   Male             NaN  Developer                  7.0  100000.0

In [65]:
data_new[data_new['job'].isnull()]

     age gender education_level  job  years_of_experience  salary
172  NaN    NaN             NaN  NaN                  NaN     NaN
260  NaN    NaN             NaN  NaN                  NaN     NaN

In [66]:
data_new[data_new['years_of_experience'].isnull()]

       age  gender education_level       job  years_of_experience  salary
172    NaN     NaN             NaN       NaN                  NaN     NaN
260    NaN     NaN             NaN       NaN                  NaN     NaN
5247  26.0  Female      Bachelor's  Social M                  NaN     NaN

In [67]:
data_new[data_new['salary'].isnull()]

,age,gender,education_level,job,years_of_experience,salary
172,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN
3136,31.0,Male,Master's,Full Stack Engineer,8.0,NaN
5247,26.0,Female,Bachelor's,Social M,NaN,NaN
6455,36.0,Male,Bachelor's,Sales Director,6.0,NaN

In [68]:
# Handling Null Values
# Menghapus baris data yang memilik null values
data_new.dropna(inplace=True)
data_new

,age,gender,education_level,job,years_of_experience,salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,phD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,phD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

Membuat Data Frame baru untuk menampung data yang tidak null

In [69]:
data_clean = data_new.copy()

Cek duplikasi dan handling duplikasi data dalam dataset

In [70]:
# Cek data duplikat
data_clean.duplicated().sum()

4912

In [71]:
# Hapus data duplikat
data_clean.drop_duplicates(inplace=True)

In [72]:
data_clean.to_excel(r'./salary-data.xlsx', index=None, header=True) 
data_clean.to_csv(r'./salary-data.csv', index=False)

In [73]:
data_clean.dtypes

age                    float64
gender                  object
education_level         object
job                     object
years_of_experience    float64
salary                 float64
dtype: object